# Ми проводимо розіграш призів серед перших 50 підписників ютуб-каналу. Ми маємо 7 призів для розіграшу. Може виникнути питання, скільки різних списків переможців ми можемо отримати під час розіграшу? Для цього ми будемо використовувати формулу сполучень без повторень
#Cnk = n! / ((n - k)! · k!)

#де n — це загальна кількість людей (випадків), а k — кількість людей, які отримали призи.

#Напишіть функцію number_of_groups, яка приймає параметри n та k, і за допомогою функції factorial повертає нам скільки різних списків переможців ми можемо отримати при розіграші

def factorial(n):
    if n < 2:
        return 1
    else:
        return n * factorial(n - 1)
    
def number_of_groups(n, k):
    a = factorial(n)  #

    b = factorial(n - k)  #

    c = factorial(k)  #

    return int(a / (b * c))  #